Documents/Д_ЗаявкаНаСогласованиеДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>Д_ЗаявкаНаСогласованиеДоговора</Name>
			<BasedOn>
				<xr:Item>Catalog.Д_ШаблоныДоговоров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доступность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текстовка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Д_ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступнаПользователям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрЛицоКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>не используется</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяБДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличныеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавитьТаблицу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчетПремии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМероприятия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСкидки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Д_ШаблоныДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Рецензенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Д_ВидыВнутреннихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Д_ВидыВнутреннихДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяВидомСЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСписка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьРедактированиеПрикрепленныхФайлов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьУправляющегоПриОтказеСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьРедактированиеПрикрепленныхФайловДляВсех</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Д_ЗаявкаНаСогласованиеДоговора/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка, РецензентКомментарий = Неопределено, МассивОткрытыхИсторий = Неопределено, МассивОткрытыхИсторийАвтора = Неопределено) Экспорт
		
	Макет = Документы.Д_СлужебнаяЗаписка.ПолучитьМакет("Печать");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	// статус
	ОбластьШапкаСтатус = Макет.ПолучитьОбласть("ШапкаСтатус");
	ОбластьТекстовка = Макет.ПолучитьОбласть("Текстовка");
	ОбластьШапкаЗаг = Макет.ПолучитьОбласть("ШтампыЗаголовок");
	ОбластьШтампы = Макет.ПолучитьОбласть("Штампы");
	ОбластьСогласование = Макет.ПолучитьОбласть("ШапкаСогласование");
	ОбластьОзнакомлениеШапка = Макет.ПолучитьОбласть("ШапкаОзнакомление");
	ОбластьОзнакомление = Макет.ПолучитьОбласть("ШтампыОзнакомление");
	ОбластьПрикрепление = Макет.ПолучитьОбласть("Прикрепление");
	ОбластьПустыеСтроки = Макет.ПолучитьОбласть("ПустыеСтроки");
	ОбластьИнициатор = Макет.ПолучитьОбласть("ШтампыИнициатор");
	ОбластьОтступ = Макет.ПолучитьОбласть("ОтступСтрока|ОтступСтолбец");
	ОбластьЛимитДЗ = Макет.ПолучитьОбласть("ЛимитДЗ");
	ОбластьЛимитДЗ1 = Макет.ПолучитьОбласть("ЛимитДЗ1");
	ОбластьЛимитДЗ2 = Макет.ПолучитьОбласть("ЛимитДЗ2");
	ОбластьЛимитДЗ3 = Макет.ПолучитьОбласть("ЛимитДЗ3");
	ОбластьЛимитДЗ4 = Макет.ПолучитьОбласть("ЛимитДЗ4");
	//ОбластьКомандировка = Макет.ПолучитьОбласть("ЗаявкаНаКомандировку");
	
	ОбластьСтроительство = Макет.ПолучитьОбласть("ШапкаСтроительство");
	
	ТабДок.Очистить();
	ВставлятьРазделительСтраниц = Ложь;
	
	//////////////////////////вывод СЗ на печать
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	*
	|ИЗ
	|	Документ.Д_ЗаявкаНаСогласованиеДоговора КАК Д_ЗаявкаНаСогласованиеДоговора
	|ГДЕ
	|	Д_ЗаявкаНаСогласованиеДоговора.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	//получаем прикрепленные объекты
	ВыборкаПоФайлам = БПСервер.ПолучитьПрикрепленныеОбъектыДляПечати(Ссылка);
	
	ВставлятьРазделительСтраниц = Ложь;
	
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
		
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВидСЗ = Справочники.Д_ВидыВнутреннихДокументов.ЗаявкаНаСогласованиеДоговора ИЛИ Выборка.ВидСЗ = Справочники.Д_ВидыВнутреннихДокументов.ЗаявкаНаСогласованиеДопСоглашения Тогда
			
			ЗаполнитьЗначенияСвойств(РеквизитыДокумента, Выборка);
			СинонимДокумента   = Строка(Выборка.ВидСЗ);;

			//ОбластьСтроительство.Параметры.Ссылка 				= Выборка.Ссылка;
			ОбластьСтроительство.Параметры.Ссылка 				= ФормированиеПечатныхФормСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента, СинонимДокумента, "ДЛФ=Д");
			ОбластьСтроительство.Параметры.НаименованиеДоговора	= Выборка.НаименованиеДоговора;
			ОбластьСтроительство.Параметры.НомерСтр 			= Выборка.НомерДоговора;
			ОбластьСтроительство.Параметры.ЧислоСтр 			= Формат(Выборка.ДатаДоговора, "ДФ=dd");
			ОбластьСтроительство.Параметры.МесяцСтр 			= Формат(Выборка.ДатаДоговора, "ДФ=ММММ");
			ОбластьСтроительство.Параметры.ГодСтр 				= Формат(Выборка.ДатаДоговора, "ДФ=гггг");
			ОбластьСтроительство.Параметры.КонтрагентСтр 		= Выборка.Контрагент;
			ОбластьСтроительство.Параметры.ЮрЛицоСтр 			= Выборка.ЮрЛицоКомпании;
			ОбластьСтроительство.Параметры.ПредметДоговораСтр 	= Выборка.Текстовка;
			ОбластьСтроительство.Параметры.ЦФОСтр 				= Выборка.СтрЦФО;
			ОбластьСтроительство.Параметры.КомментарийСтр 		= Выборка.Комментарий;
			//ОбластьСтроительство.Параметры.ПроектСтр 			= Выборка.Проект;
			ОбластьСтроительство.Параметры.ПредприятиеСтр 		= Выборка.Предприятие;
			ОбластьСтроительство.Параметры.ОбъектСтр 			= Выборка.Подразделение;
			//ОбластьСтроительство.Параметры.СтатьяДДССтр 		= Выборка.СтатьяБДДС;
			//ОбластьСтроительство.Параметры.ОбъектСтр			= Выборка.Объект;
			ОбластьСтроительство.Параметры.Сумма				= Выборка.Сумма;
			ОбластьСтроительство.Параметры.УсловияОплаты		= Выборка.УсловияОплаты;
			ОбластьСтроительство.Параметры.Автор				= Выборка.Автор;
			ТабДок.Вывести(ОбластьСтроительство);
			
			Пока ВыборкаПоФайлам.Следующий() Цикл 
				ОбластьПрикрепление.Параметры.Вложение = Строка(ВыборкаПоФайлам.Файл);
				ОбластьПрикрепление.Параметры.РасшифровкаВложение = ВыборкаПоФайлам.Файл; //Новый Структура("Файл", ВыборкаПоФайлам.Файл)
				ТабДок.Вывести(ОбластьПрикрепление);
			КонецЦикла;	
		Иначе
			//Если Выборка.ЦФОвТЧ Тогда
			СуфиксЦФО = "ЦФО";
			//Иначе
			//	СуфиксЦФО = "";		
			//КонецЕсли;
			
			ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧ" + СуфиксЦФО);
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал" + СуфиксЦФО);
						
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			Если Выборка.ВидСЗ = Справочники.Д_ВидыВнутреннихДокументов.Приказ Тогда
				ОбластьЗаголовок.Параметры.Ссылка = "Приказ " + Прав(Выборка.Ссылка, 34);
			Иначе	
				ОбластьЗаголовок.Параметры.Ссылка = Выборка.Ссылка;
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьЗаголовок);
			
			ОбластьШапка.Параметры.Дата = Выборка.Дата;
			ОбластьШапка.Параметры.Комментарий = Выборка.Комментарий;
			ОбластьШапка.Параметры.ВидСЗ = ?(Выборка.ВидСЗ = Справочники.Д_ВидыВнутреннихДокументов.ЗаявкаНаКадровоеДвижение, "" + Выборка.ВидСЗ + " (" + Выборка.ВидКадровогоДвижения + ")", Выборка.ВидСЗ);
			// имя пользователя и должность
			ИмяДолжность = БПСервер.ПолучитьИмяИДолжностьПользователя(Выборка.Дата, ?(ПустаяСтрока(Выборка.Автор), Выборка.Предприятие.Финансист, Выборка.Автор));
			ОбластьШапка.Параметры.ОтКого = ?(ЗначениеЗаполнено(ИмяДолжность.ПредставлениеПользователя), ИмяДолжность.ПредставлениеПользователя + " ", "") + ?(ЗначениеЗаполнено(ИмяДолжность.Должность), ИмяДолжность.Должность, "");	
			
			// закомментированно 01.03.13 строка
			//ИмяДолжность = БПСервер.ПолучитьИмяИДолжностьПользователя(Выборка.Дата, Выборка.Кому);
			//ОбластьШапка.Параметры.Кому = ?(ПустаяСтрока(Выборка.Кому), "ДКФ", Строка(ИмяДолжность.ПредставлениеПользователя) + ?(ЗначениеЗаполнено(ИмяДолжность.Должность), " " + "(" + Строка(ИмяДолжность.Должность) + ")", ""));
			
			СтрокаКому = "";		
			Для ИндСтр = 0 По Выборка.Ссылка.Рецензенты.Количество() - 1 Цикл
				
				ИмяДолжность = БПСервер.ПолучитьИмяИДолжностьПользователя(Выборка.Дата, Выборка.Ссылка.Рецензенты[ИндСтр].Пользователь);
				СтрокаКому = СтрокаКому + Строка(ИмяДолжность.ПредставлениеПользователя) + ?(ЗначениеЗаполнено(ИмяДолжность.Должность), " " + ИмяДолжность.Должность, "") + ?(ИндСтр <> Выборка.Ссылка.Рецензенты.Количество() - 1, "; ", ""); 
				
			КонецЦикла;
			
			ОбластьШапка.Параметры.Кому = ?(ПустаяСтрока(Выборка.Кому), "ДКФ", СтрокаКому);
			
			ОбластьШапка.Параметры.ЦФО = Строка(Выборка.Предприятие) + ?(Выборка.Предприятие.УчетПоПодразделениям, " (" + Строка(Выборка.Подразделение) + ")", "");
			
			ТабДок.Вывести(ОбластьШапка);
			
			// статус 
			ОбластьШапкаСтатус.Параметры.ТекущийСтатус = БПСервер.ПолучитьТекущуюТочкуМаршрута(Ссылка);
			Если Выборка.ВидСЗ = Справочники.Д_ВидыВнутреннихДокументов.Приказ Тогда
				ОбластьШапкаСтатус.Параметры.Действующий = "(" +Строка(?(Выборка.НеДействующий, "Не действующий", "Действующий"))+")";
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьШапкаСтатус);
			
			Пока ВыборкаПоФайлам.Следующий() Цикл 
				ОбластьПрикрепление.Параметры.Вложение = Строка(ВыборкаПоФайлам.Файл);
				ОбластьПрикрепление.Параметры.РасшифровкаВложение = ВыборкаПоФайлам.Файл; //Новый Структура("Файл", ВыборкаПоФайлам.Файл)
				ТабДок.Вывести(ОбластьПрикрепление);
			КонецЦикла;	
			//Иначе
			//	ТабДок.Вывести(ОбластьПустыеСтроки);
			//КонецЕсли;
				
				СтруктураПоиска = Новый Структура("Заявка", Выборка);
				
				//вывод для лимитов
				//Если Выборка.ВидСЗ = Справочники.Д_ВидыВнутреннихДокументов.СогласованиеУсловийКлиента Тогда
				//	
				//	//ЗначенияЛимитов = РасчитатьЛимиты(Предприятия, МассивСтатей, Выборка);	
				//	ТЗ = Выборка.УсловияКлиента.Выгрузить();
				//	
				//	Для каждого ТекСтрока Из ТЗ Цикл
				//		ОбластьЛимитДЗ1.Параметры.Заполнить(ТекСтрока);
				//		ОбластьЛимитДЗ1.Параметры.Дата = Формат(ТекСтрока.Дата, "ДФ=dd.MM.yyyy");
				//		
				//		ТабДок.Вывести(ОбластьЛимитДЗ1);		
				//		Если НачалоМесяца(Выборка.Дата) > ТекСтрока.Дата Тогда
				//			ТабДок.Вывести(ОбластьЛимитДЗ2);		
				//		Иначе
				//		КонецЕсли;
				//		ОбластьЛимитДЗ.Параметры.Заполнить(ТекСтрока);
				//		ТабДок.Вывести(ОбластьЛимитДЗ);
				//		
				//		//Выводим реестр договоренностей
				//		ТЗ_Договоренностей = Выборка.ДоговоренностиКлиента.Выгрузить();
				//		СтруктураПоиска = Новый Структура("Контрагент", ТекСтрока.Контрагент);
				//		ОтобранныеСтр = ТЗ_Договоренностей.НайтиСтроки(СтруктураПоиска);
				//		Если ТЗ_Договоренностей.Количество() Тогда
				//			Для каждого ТекСТрока2 Из ОтобранныеСтр Цикл
				//				ОбластьЛимитДЗ4.Параметры.Заполнить(ТекСтрока2);
				//				ТабДок.Вывести(ОбластьЛимитДЗ4);
				//			КонецЦикла; 
				//		Иначе	
				//			ОбластьЛимитДЗ4.Параметры.Заполнить(ТекСтрока);
				//			ТабДок.Вывести(ОбластьЛимитДЗ4);
				//		КонецЕсли;
				//		//конец вывода реестра договоренностей
				//		ОбластьЛимитДЗ3.Параметры.Заполнить(ТекСтрока);
				//		ТабДок.Вывести(ОбластьЛимитДЗ3);
				//	КонецЦикла; 
				//КонецЕсли;
			КонецЕсли;
			
			Если Не ПустаяСтрока(Выборка.Текстовка) Тогда
				ОбластьТекстовка.Параметры.Текстовка = Выборка.Текстовка;
				ТабДок.Вывести(ОбластьТекстовка);		
			КонецЕсли;
			
			
			Если Выборка.ДобавитьТаблицу Тогда
				ТабличныеДанные = Выборка.ТабличныеДанные.Получить();
				ТабДок.Вывести(ОбластьОтступ);
				ТабДок.Присоединить(ТабличныеДанные);		
			КонецЕсли;
			
		
		
		БПСервер.ПоказатьРецензентов(ТабДок, Выборка.Ссылка, Неопределено, Ссылка, "Штампы", РецензентКомментарий, МассивОткрытыхИсторий, МассивОткрытыхИсторийАвтора);
		
		ВставлятьРазделительСтраниц = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
		
	Если ВидФормы = "ФормаСписка" ИЛИ ВидФормы = "ФормаВыбора" Тогда
		СтандартнаяОбработка = Ложь;
		//НовыйОтбор = Новый Структура("Тип", Тип("ДокументСсылка.Д_ЗаявкаНаТорговлю"));
		ПараметрыСеанса.СтруктураПараметровФормСпискаДокументооборота = Новый ФиксированнаяСтруктура(Новый Структура("ВидВнутреннегоДокумента, ИмяДокумента, ФормаВыбора", Справочники.Д_ВидыВнутреннихДокументов.ЗаявкаНаСогласованиеДоговора, "Д_ЗаявкаНаСогласованиеДоговора",  ВидФормы = "ФормаВыбора"));
		ВыбраннаяФорма = "ЖурналДокументов.ВнутренниеДокументы.Форма.ФормаСписка";
	КонецЕсли;
	

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекРекв = БюджетныйНаСервере.ВернутьРеквизиты(Данные.Ссылка, "Комментарий, ВидСЗ, Номер, Дата");
	Если НЕ ТекРекв = Неопределено Тогда
		Представление = Строка(ТекРекв.ВидСЗ) + " " + Строка(ТекРекв.Номер) + " от " + Формат(ТекРекв.Дата, "ДФ=dd.MM.yyyy");	
	КонецЕсли;
КонецПроцедуры

Процедура ПечатьФорматируемогоДокумента(ТабДок, Ссылка, РецензентКомментарий = Неопределено, МассивОткрытыхИсторий = Неопределено, МассивОткрытыхИсторийАвтора = Неопределено, МобильныйКлиент = Ложь) Экспорт
	
	ФормДок = Новый ФорматированныйДокумент;
		
	//////////////////////////вывод СЗ на печать
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	*
	|ИЗ
	|	Документ.Д_ЗаявкаНаСогласованиеДоговора КАК Д_СлужебнаяЗаписка
	|ГДЕ
	|	Д_СлужебнаяЗаписка.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	//получаем прикрепленные объекты
	ВыборкаПоФайлам = БПСервер.ПолучитьПрикрепленныеОбъектыДляПечати(Ссылка);
	
	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		БПСервер.НовыйПараграфТекстФД(ФормДок, Строка(ТипЗнч(Выборка.Ссылка)) + " №" + Выборка.Номер + " от " + Формат(Выборка.Дата, "ДФ=dd.MM.yyyy"), Истина);
		БПСервер.НовыйПараграфТекстФД(ФормДок, Символы.ПС);
		
		// имя пользователя и должность
		СтрокаКому = "";		
		Для ИндСтр = 0 По Выборка.Ссылка.Рецензенты.Количество() - 1 Цикл
			ИмяДолжность = БПСервер.ПолучитьИмяИДолжностьПользователя(Выборка.Дата, Выборка.Ссылка.Рецензенты[ИндСтр].Пользователь);
			СтрокаКому = СтрокаКому + Строка(ИмяДолжность.ПредставлениеПользователя) + ?(ЗначениеЗаполнено(ИмяДолжность.Должность), " " + ИмяДолжность.Должность, "") + ?(ИндСтр <> Выборка.Ссылка.Рецензенты.Количество() - 1, "; ", ""); 
		КонецЦикла;
		
		ИмяДолжность = БПСервер.ПолучитьИмяИДолжностьПользователя(Выборка.Дата, Выборка.Автор);
		//ОтИмени = БПСервер.ПолучитьИмяИДолжностьПользователя(Выборка.Дата, Выборка.ОтИмени);
		БПСервер.НовыйПараграфТекстФД(ФормДок, "Дата: " + Формат(Выборка.Дата, "ДФ=dd.MM.yyyy"));
		БПСервер.НовыйПараграфТекстФД(ФормДок, "Номер: " + Выборка.Номер);
		БПСервер.НовыйПараграфТекстФД(ФормДок, "Автор: " + ?(ЗначениеЗаполнено(ИмяДолжность.ПредставлениеПользователя), ИмяДолжность.ПредставлениеПользователя + " ", "") + ?(ЗначениеЗаполнено(ИмяДолжность.Должность), ИмяДолжность.Должность, ""));
		//БПСервер.НовыйПараграфТекстФД(ФормДок, "От имени: " + ?(ЗначениеЗаполнено(ОтИмени.ПредставлениеПользователя), ОтИмени.ПредставлениеПользователя + " ", "") + ?(ЗначениеЗаполнено(ОтИмени.Должность), ОтИмени.Должность, ""));
		БПСервер.НовыйПараграфТекстФД(ФормДок, "Вид: " + Выборка.ВидСЗ);
		//БПСервер.НовыйПараграфТекстФД(ФормДок, "Кому: " + СтрокаКому);
		БПСервер.НовыйПараграфТекстФД(ФормДок, "Предприятие: " + Строка(Выборка.Предприятие) + ?(Выборка.Предприятие.УчетПоПодразделениям, " (" + Строка(Выборка.Подразделение) + ")", ""));
		БПСервер.НовыйПараграфТекстФД(ФормДок, "Контрагент: " + Выборка.Контрагент);
		БПСервер.НовыйПараграфТекстФД(ФормДок, "Организация: " + Выборка.ЮрЛицоКомпании);
		БПСервер.НовыйПараграфТекстФД(ФормДок, "Договор: " + Выборка.НаименованиеДоговора + " №" + Выборка.НомерДоговора + " от " + Формат(Выборка.ДатаДоговора, "ДФ=dd.MM.yyyy"));
		БПСервер.НовыйПараграфТекстФД(ФормДок, "Сумма: " + Выборка.Сумма);
		БПСервер.НовыйПараграфТекстФД(ФормДок, "Предмет: " + Выборка.Текстовка);
		БПСервер.НовыйПараграфТекстФД(ФормДок, "Условия: " + Выборка.УсловияОплаты);
		БПСервер.НовыйПараграфТекстФД(ФормДок, "Примечания: " + Выборка.Комментарий);
		БПСервер.НовыйПараграфТекстФД(ФормДок, Символы.ПС);
		БПСервер.НовыйПараграфТекстФД(ФормДок, "Статус: " + БПСервер.ПолучитьТекущуюТочкуМаршрута(Ссылка));
		
		БПСервер.НовыйПараграфТекстФД(ФормДок, "Заголовок: " + Выборка.Комментарий);
		БПСервер.НовыйПараграфТекстФД(ФормДок, Символы.ПС);
		
		//СтруктураПоиска = Новый Структура("Заявка", Выборка);
		
		//БПСервер.НовыйПараграфТекстФД(ФормДок, "Сожержание:", Истина);
		////НовыйПараграфТекстФД(ФормДок, Символы.ПС);
		//БПСервер.ДобавитьЭлементыФР(ФормДок, ТабДок);
		//БПСервер.НовыйПараграфТекстФД(ФормДок, Символы.ПС);
		
		БПСервер.ПоказатьРецензентов(ФормДок, Выборка.Ссылка, Неопределено, Ссылка, "Штампы", РецензентКомментарий, МассивОткрытыхИсторий, МассивОткрытыхИсторийАвтора);
		
		БПСервер.ДобавитьКомментарии(ФормДок, Выборка.Ссылка);

	КонецЦикла;
	
	ТабДок = ФормДок;
	
КонецПроцедуры
